{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "6e435bbe-cb94-4e57-abc9-7c13d5ce3f92",
   "metadata": {},
   "outputs": [],
   "source": [
    "# =========================================\n",
    "# Import packages and set up Neo4j\n",
    "# =========================================\n",
    "from dotenv import load_dotenv\n",
    "import os\n",
    "\n",
    "# Common data processing\n",
    "import json\n",
    "import textwrap\n",
    "\n",
    "# Langchain (modern)\n",
    "from langchain_community.graphs import Neo4jGraph\n",
    "from langchain_community.vectorstores import Neo4jVector\n",
    "from langchain_openai import OpenAIEmbeddings, ChatOpenAI\n",
    "from langchain_text_splitters import RecursiveCharacterTextSplitter\n",
    "\n",
    "# LCEL (modern chains)\n",
    "from langchain_core.runnables import RunnablePassthrough\n",
    "from langchain_core.output_parsers import StrOutputParser\n",
    "from langchain_core.prompts import ChatPromptTemplate\n",
    "\n",
    "# Warning control\n",
    "import warnings\n",
    "warnings.filterwarnings(\"ignore\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "e459aa1d-0149-4568-a492-b4b9e83410db",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Load from environment\n",
    "load_dotenv('.env', override=True)\n",
    "NEO4J_URI = os.getenv('NEO4J_URI')\n",
    "NEO4J_USERNAME = os.getenv('NEO4J_USERNAME')\n",
    "NEO4J_PASSWORD = os.getenv('NEO4J_PASSWORD')\n",
    "NEO4J_DATABASE = os.getenv('NEO4J_DATABASE') or 'neo4j'\n",
    "OPENAI_API_KEY = os.getenv('OPENAI_API_KEY')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "386ef679-769e-4082-96eb-d1220f2c925e",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Initialize models\n",
    "embeddings = OpenAIEmbeddings()\n",
    "llm = ChatOpenAI(temperature=0)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "74ec89ff-0bb2-484b-9904-41e2baf9e7f9",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Constants\n",
    "VECTOR_INDEX_NAME = 'form_10k_chunks'\n",
    "VECTOR_NODE_LABEL = 'Chunk'\n",
    "VECTOR_SOURCE_PROPERTY = 'text'\n",
    "VECTOR_EMBEDDING_PROPERTY = 'textEmbedding'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "ebd3bfca-3629-4d89-9d9a-1fd725b9f9fa",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Neo4j connection\n",
    "kg = Neo4jGraph(\n",
    "    url=NEO4J_URI,\n",
    "    username=NEO4J_USERNAME,\n",
    "    password=NEO4J_PASSWORD,\n",
    "    database=NEO4J_DATABASE\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "f86a16f7-be6b-404b-9bac-fd51d222122c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<class 'dict'>\n",
      "item1 <class 'str'>\n",
      "item1a <class 'str'>\n",
      "item7 <class 'str'>\n",
      "item7a <class 'str'>\n",
      "cik <class 'str'>\n",
      "cusip6 <class 'str'>\n",
      "cusip <class 'list'>\n",
      "names <class 'list'>\n",
      "source <class 'str'>\n",
      ">Item 1.  \n",
      "Business\n",
      "\n",
      "\n",
      "Overview\n",
      "\n",
      "\n",
      "NetApp, Inc. (NetApp, we, us or the Company) is a global cloud-led, data-centric software company. We were incorporated in 1992 and are headquartered in San Jose, California. Building on more than three decades of innovation, we give customers the freedom to manage applications and data across hybrid multicloud environments. Our portfolio of cloud services, and storage infrastructure, powered by intelligent data management software, enables applications to run faster, more reliably, and more securely, all at a lower cost.\n",
      "\n",
      "\n",
      "Our opportunity is defined by the durable megatrends of data-driven digital and cloud transformations. NetApp helps organizations meet the complexities created by rapid data and cloud growth, multi-cloud management, and the adoption of next-generation technologies, such as AI, Kubernetes, and modern databases. Our modern approach to hybrid, multicloud infrastructure and data management, which we term ‘evolved cloud’, provides customers the ability to leverage data across their entire estate with simplicity, security, and sustainability which increases our relevance and value to our customers.\n",
      "\n",
      "\n",
      "In an evolved cloud state, the cloud is fully integrated into an organization’s architecture and operations. Data centers and clouds are seamlessly united and hybrid multicloud operations are simplified, with consistency and observability across environments. The key benefits NetApp brings to an organization’s hybrid multicloud envir\n"
     ]
    }
   ],
   "source": [
    "# =========================================\n",
    "# Take a look at a Form 10-K json file\n",
    "# =========================================\n",
    "first_file_name = \"./data/form10k/0000950170-23-027948.json\"\n",
    "first_file_as_object = json.load(open(first_file_name))\n",
    "\n",
    "print(type(first_file_as_object))\n",
    "for k, v in first_file_as_object.items():\n",
    "    print(k, type(v))\n",
    "\n",
    "item1_text = first_file_as_object['item1']\n",
    "print(item1_text[:1500])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "04ec8e85-77bd-4e7a-989c-d3606978760f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<class 'list'>\n",
      "254\n",
      ">Item 1.  \n",
      "Business\n",
      "\n",
      "\n",
      "Overview\n",
      "\n",
      "\n",
      "NetApp, Inc. (NetApp, we, us or the Company) is a global cloud-led, data-centric software company. We were incorporated in 1992 and are headquartered in San Jose, California. Building on more than three decades of innovation, we give customers the freedom to manage applications and data across hybrid multicloud environments. Our portfolio of cloud services, and storage infrastructure, powered by intelligent data management software, enables applications to run faster, more reliably, and more securely, all at a lower cost.\n",
      "\n",
      "\n",
      "Our opportunity is defined by the durable megatrends of data-driven digital and cloud transformations. NetApp helps organizations meet the complexities created by rapid data and cloud growth, multi-cloud management, and the adoption of next-generation technologies, such as AI, Kubernetes, and modern databases. Our modern approach to hybrid, multicloud infrastructure and data management, which we term ‘evolved cloud’, provides customers the ability to leverage data across their entire estate with simplicity, security, and sustainability which increases our relevance and value to our customers.\n",
      "\n",
      "\n",
      "In an evolved cloud state, the cloud is fully integrated into an organization’s architecture and operations. Data centers and clouds are seamlessly united and hybrid multicloud operations are simplified, with consistency and observability across environments. The key benefits NetApp brings to an organization’s hybrid multicloud environment are:\n",
      "\n",
      "\n",
      "•\n",
      "Operational simplicity: NetApp’s use of open source, open architectures and APIs, microservices, and common capabilities and data services facilitate the creation of applications that can run anywhere.\n",
      "\n",
      "\n",
      "•\n",
      "Flexibility and consistency: NetApp makes moving data and applications between environments seamless through a common storage foundation across on-premises and multicloud environments.\n"
     ]
    }
   ],
   "source": [
    "# =========================================\n",
    "# Split Form 10-K sections into chunks\n",
    "# =========================================\n",
    "text_splitter = RecursiveCharacterTextSplitter(\n",
    "    chunk_size=2000,\n",
    "    chunk_overlap=200,\n",
    "    length_function=len,\n",
    "    is_separator_regex=False,\n",
    ")\n",
    "\n",
    "item1_text_chunks = text_splitter.split_text(item1_text)\n",
    "\n",
    "print(type(item1_text_chunks))\n",
    "print(len(item1_text_chunks))\n",
    "print(item1_text_chunks[0])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "787194bc-13d1-4a35-9b20-749872344ff2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Processing item1 from ./data/form10k/0000950170-23-027948.json\n",
      "\tSplit into 20 chunks\n",
      "Processing item1a from ./data/form10k/0000950170-23-027948.json\n",
      "\tSplit into 1 chunks\n",
      "Processing item7 from ./data/form10k/0000950170-23-027948.json\n",
      "\tSplit into 1 chunks\n",
      "Processing item7a from ./data/form10k/0000950170-23-027948.json\n",
      "\tSplit into 1 chunks\n",
      "{'text': '>Item 1.  \\nBusiness\\n\\n\\nOverview\\n\\n\\nNetApp, Inc. (NetApp, we, us or the Company) is a global cloud-led, data-centric software company. We were incorporated in 1992 and are headquartered in San Jose, California. Building on more than three decades of innovation, we give customers the freedom to manage applications and data across hybrid multicloud environments. Our portfolio of cloud services, and storage infrastructure, powered by intelligent data management software, enables applications to run faster, more reliably, and more securely, all at a lower cost.\\n\\n\\nOur opportunity is defined by the durable megatrends of data-driven digital and cloud transformations. NetApp helps organizations meet the complexities created by rapid data and cloud growth, multi-cloud management, and the adoption of next-generation technologies, such as AI, Kubernetes, and modern databases. Our modern approach to hybrid, multicloud infrastructure and data management, which we term ‘evolved cloud’, provides customers the ability to leverage data across their entire estate with simplicity, security, and sustainability which increases our relevance and value to our customers.\\n\\n\\nIn an evolved cloud state, the cloud is fully integrated into an organization’s architecture and operations. Data centers and clouds are seamlessly united and hybrid multicloud operations are simplified, with consistency and observability across environments. The key benefits NetApp brings to an organization’s hybrid multicloud environment are:\\n\\n\\n•\\nOperational simplicity: NetApp’s use of open source, open architectures and APIs, microservices, and common capabilities and data services facilitate the creation of applications that can run anywhere.\\n\\n\\n•\\nFlexibility and consistency: NetApp makes moving data and applications between environments seamless through a common storage foundation across on-premises and multicloud environments.', 'f10kItem': 'item1', 'chunkSeqId': 0, 'formId': '0000950170-23-027948', 'chunkId': '0000950170-23-027948-item1-chunk0000', 'names': ['Netapp Inc', 'NETAPP INC'], 'cik': '1002047', 'cusip6': '64110D', 'source': 'https://www.sec.gov/Archives/edgar/data/1002047/000095017023027948/0000950170-23-027948-index.htm'}\n"
     ]
    }
   ],
   "source": [
    "def split_form10k_data_from_file(file):\n",
    "    chunks_with_metadata = []\n",
    "    file_as_object = json.load(open(file))\n",
    "\n",
    "    for item in ['item1', 'item1a', 'item7', 'item7a']:\n",
    "        print(f'Processing {item} from {file}')\n",
    "        item_text = file_as_object[item]\n",
    "        item_text_chunks = text_splitter.split_text(item_text)\n",
    "\n",
    "        chunk_seq_id = 0\n",
    "        for chunk in item_text_chunks[:20]:\n",
    "            form_id = file[file.rindex('/') + 1:file.rindex('.')]\n",
    "\n",
    "            chunks_with_metadata.append({\n",
    "                'text': chunk,\n",
    "                'f10kItem': item,\n",
    "                'chunkSeqId': chunk_seq_id,\n",
    "                'formId': f'{form_id}',\n",
    "                'chunkId': f'{form_id}-{item}-chunk{chunk_seq_id:04d}',\n",
    "                'names': file_as_object['names'],\n",
    "                'cik': file_as_object['cik'],\n",
    "                'cusip6': file_as_object['cusip6'],\n",
    "                'source': file_as_object['source'],\n",
    "            })\n",
    "            chunk_seq_id += 1\n",
    "\n",
    "        print(f'\\tSplit into {chunk_seq_id} chunks')\n",
    "\n",
    "    return chunks_with_metadata\n",
    "\n",
    "\n",
    "first_file_chunks = split_form10k_data_from_file(first_file_name)\n",
    "print(first_file_chunks[0])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "029c28c6-dcbe-4c77-89fe-c0aace05d74b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Created 23 nodes\n",
      "[{'nodeCount': 195}]\n"
     ]
    }
   ],
   "source": [
    "# =========================================\n",
    "# Create graph nodes using text chunks\n",
    "# =========================================\n",
    "merge_chunk_node_query = \"\"\"\n",
    "MERGE (c:Chunk {chunkId: $chunkParam.chunkId})\n",
    "ON CREATE SET \n",
    "    c.names = $chunkParam.names,\n",
    "    c.formId = $chunkParam.formId,\n",
    "    c.cik = $chunkParam.cik,\n",
    "    c.cusip6 = $chunkParam.cusip6,\n",
    "    c.source = $chunkParam.source,\n",
    "    c.f10kItem = $chunkParam.f10kItem,\n",
    "    c.chunkSeqId = $chunkParam.chunkSeqId,\n",
    "    c.text = $chunkParam.text\n",
    "RETURN c\n",
    "\"\"\"\n",
    "\n",
    "kg.query(\"\"\"\n",
    "CREATE CONSTRAINT unique_chunk IF NOT EXISTS\n",
    "FOR (c:Chunk) REQUIRE c.chunkId IS UNIQUE\n",
    "\"\"\")\n",
    "\n",
    "node_count = 0\n",
    "for chunk in first_file_chunks:\n",
    "    kg.query(merge_chunk_node_query, params={'chunkParam': chunk})\n",
    "    node_count += 1\n",
    "\n",
    "print(f\"Created {node_count} nodes\")\n",
    "\n",
    "print(kg.query(\"MATCH (n) RETURN count(n) AS nodeCount\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "f83bec76-83c7-4cf4-82ee-db348363bfbc",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{'id': 6, 'name': 'form_10k_chunks', 'state': 'ONLINE', 'populationPercent': 100.0, 'type': 'VECTOR', 'entityType': 'NODE', 'labelsOrTypes': ['Chunk'], 'properties': ['textEmbedding'], 'indexProvider': 'vector-3.0', 'owningConstraint': None, 'lastRead': None, 'readCount': None}, {'id': 1, 'name': 'index_343aff4e', 'state': 'ONLINE', 'populationPercent': 100.0, 'type': 'LOOKUP', 'entityType': 'NODE', 'labelsOrTypes': None, 'properties': None, 'indexProvider': 'token-lookup-1.0', 'owningConstraint': None, 'lastRead': neo4j.time.DateTime(2026, 3, 28, 12, 47, 24, 708000000, tzinfo=<UTC>), 'readCount': 172}, {'id': 2, 'name': 'index_f7700477', 'state': 'ONLINE', 'populationPercent': 100.0, 'type': 'LOOKUP', 'entityType': 'RELATIONSHIP', 'labelsOrTypes': None, 'properties': None, 'indexProvider': 'token-lookup-1.0', 'owningConstraint': None, 'lastRead': neo4j.time.DateTime(2024, 1, 18, 11, 46, 2, 950000000, tzinfo=<UTC>), 'readCount': 1}, {'id': 3, 'name': 'movie_tagline_embeddings', 'state': 'ONLINE', 'populationPercent': 100.0, 'type': 'VECTOR', 'entityType': 'NODE', 'labelsOrTypes': ['Movie'], 'properties': ['taglineEmbedding'], 'indexProvider': 'vector-3.0', 'owningConstraint': None, 'lastRead': neo4j.time.DateTime(2026, 3, 28, 10, 18, 44, 887000000, tzinfo=<UTC>), 'readCount': 2}, {'id': 4, 'name': 'unique_chunk', 'state': 'ONLINE', 'populationPercent': 100.0, 'type': 'RANGE', 'entityType': 'NODE', 'labelsOrTypes': ['Chunk'], 'properties': ['chunkId'], 'indexProvider': 'range-1.0', 'owningConstraint': 'unique_chunk', 'lastRead': neo4j.time.DateTime(2026, 3, 28, 12, 54, 43, 489000000, tzinfo=<UTC>), 'readCount': 46}]\n"
     ]
    }
   ],
   "source": [
    "# =========================================\n",
    "# Create a vector index\n",
    "# =========================================\n",
    "kg.query(f\"\"\"\n",
    "CREATE VECTOR INDEX {VECTOR_INDEX_NAME} IF NOT EXISTS\n",
    "FOR (c:{VECTOR_NODE_LABEL}) ON (c.{VECTOR_EMBEDDING_PROPERTY})\n",
    "OPTIONS {{\n",
    "  indexConfig: {{\n",
    "    `vector.dimensions`: 1536,\n",
    "    `vector.similarity_function`: 'cosine'\n",
    "  }}\n",
    "}}\n",
    "\"\"\")\n",
    "\n",
    "print(kg.query(\"SHOW INDEXES\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "c72d0892-f028-40b7-99f3-759d2b042b40",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node properties:\n",
      "Movie {title: STRING, taglineEmbedding: LIST, tagline: STRING, released: INTEGER}\n",
      "Person {born: INTEGER, name: STRING, lastSeen: INTEGER}\n",
      "Chunk {textEmbedding: LIST, chunkId: STRING, f10kItem: STRING, chunkSeqId: INTEGER, text: STRING, cik: STRING, cusip6: STRING, names: LIST, formId: STRING, source: STRING}\n",
      "Relationship properties:\n",
      "ACTED_IN {roles: LIST}\n",
      "REVIEWED {summary: STRING, rating: INTEGER}\n",
      "The relationships:\n",
      "(:Person)-[:ACTED_IN]->(:Movie)\n",
      "(:Person)-[:DIRECTED]->(:Movie)\n",
      "(:Person)-[:PRODUCED]->(:Movie)\n",
      "(:Person)-[:WROTE]->(:Movie)\n",
      "(:Person)-[:FOLLOWS]->(:Person)\n",
      "(:Person)-[:REVIEWED]->(:Movie)\n",
      "(:Person)-[:KNOWS]->(:Person)\n"
     ]
    }
   ],
   "source": [
    "# =========================================\n",
    "# Calculate embedding vectors for chunks and populate index\n",
    "# =========================================\n",
    "chunks = kg.query(\"\"\"\n",
    "MATCH (c:Chunk)\n",
    "WHERE c.textEmbedding IS NULL\n",
    "RETURN elementId(c) AS id, c.text AS text\n",
    "\"\"\")\n",
    "\n",
    "for chunk in chunks:\n",
    "    chunk[\"embedding\"] = embeddings.embed_query(chunk[\"text\"])\n",
    "\n",
    "kg.query(\"\"\"\n",
    "UNWIND $rows AS row\n",
    "MATCH (c:Chunk)\n",
    "WHERE elementId(c) = row.id\n",
    "SET c.textEmbedding = row.embedding\n",
    "\"\"\", params={\"rows\": chunks})\n",
    "\n",
    "kg.refresh_schema()\n",
    "print(kg.schema)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "912cfe31-9bc3-4ac1-ae58-5ea5b759721a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'score': 0.9307861328125, 'text': '>Item 1.  \\nBusiness\\n\\n\\nOverview\\n\\n\\nNetApp, Inc. (NetApp, we, us or the Company) is a global cloud-led, data-centric software company. We were incorporated in 1992 and are headquartered in San Jose, California. Building on more than three decades of innovation, we give customers the freedom to manage applications and data across hybrid multicloud environments. Our portfolio of cloud services, and storage infrastructure, powered by intelligent data management software, enables applications to run faster, more reliably, and more securely, all at a lower cost.\\n\\n\\nOur opportunity is defined by the durable megatrends of data-driven digital and cloud transformations. NetApp helps organizations meet the complexities created by rapid data and cloud growth, multi-cloud management, and the adoption of next-generation technologies, such as AI, Kubernetes, and modern databases. Our modern approach to hybrid, multicloud infrastructure and data management, which we term ‘evolved cloud’, provides customers the ability to leverage data across their entire estate with simplicity, security, and sustainability which increases our relevance and value to our customers.\\n\\n\\nIn an evolved cloud state, the cloud is fully integrated into an organization’s architecture and operations. Data centers and clouds are seamlessly united and hybrid multicloud operations are simplified, with consistency and observability across environments. The key benefits NetApp brings to an organization’s hybrid multicloud environment are:\\n\\n\\n•\\nOperational simplicity: NetApp’s use of open source, open architectures and APIs, microservices, and common capabilities and data services facilitate the creation of applications that can run anywhere.\\n\\n\\n•\\nFlexibility and consistency: NetApp makes moving data and applications between environments seamless through a common storage foundation across on-premises and multicloud environments.'}\n"
     ]
    }
   ],
   "source": [
    "# =========================================\n",
    "# Use similarity search to find relevant chunks\n",
    "# =========================================\n",
    "def neo4j_vector_search(question):\n",
    "    embedding = embeddings.embed_query(question)\n",
    "\n",
    "    query = \"\"\"\n",
    "    CALL db.index.vector.queryNodes($index_name, $top_k, $embedding)\n",
    "    YIELD node, score\n",
    "    RETURN score, node.text AS text\n",
    "    \"\"\"\n",
    "\n",
    "    return kg.query(query, params={\n",
    "        \"index_name\": VECTOR_INDEX_NAME,\n",
    "        \"top_k\": 5,\n",
    "        \"embedding\": embedding\n",
    "    })\n",
    "\n",
    "\n",
    "search_results = neo4j_vector_search(\n",
    "    \"In a single sentence, tell me about Netapp.\"\n",
    ")\n",
    "\n",
    "print(search_results[0])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "b8424ed7-3b79-4861-8d6d-32283b53074c",
   "metadata": {},
   "outputs": [],
   "source": [
    "# =========================================\n",
    "# Set up a LangChain RAG workflow to chat with the form\n",
    "# =========================================\n",
    "\n",
    "# Vector store\n",
    "neo4j_vector_store = Neo4jVector.from_existing_graph(\n",
    "    embedding=embeddings,\n",
    "    url=NEO4J_URI,\n",
    "    username=NEO4J_USERNAME,\n",
    "    password=NEO4J_PASSWORD,\n",
    "    index_name=VECTOR_INDEX_NAME,\n",
    "    node_label=VECTOR_NODE_LABEL,\n",
    "    text_node_properties=[VECTOR_SOURCE_PROPERTY],\n",
    "    embedding_node_property=VECTOR_EMBEDDING_PROPERTY,\n",
    ")\n",
    "\n",
    "retriever = neo4j_vector_store.as_retriever()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "524e4b98-e6f4-4ae7-ae80-854eb679bc9c",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Prompt\n",
    "prompt = ChatPromptTemplate.from_template(\"\"\"\n",
    "Answer the question based only on the context below.\n",
    "\n",
    "Context:\n",
    "{context}\n",
    "\n",
    "Question:\n",
    "{question}\n",
    "\n",
    "Answer:\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "519dd266-a570-4c04-bc1e-c99a19536cfe",
   "metadata": {},
   "outputs": [],
   "source": [
    "# LCEL RAG chain\n",
    "rag_chain = (\n",
    "    {\n",
    "        \"context\": retriever,\n",
    "        \"question\": RunnablePassthrough()\n",
    "    }\n",
    "    | prompt\n",
    "    | llm\n",
    "    | StrOutputParser()\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "68adc1e5-5188-44d0-9ec2-f0dcc9f5bfe9",
   "metadata": {},
   "outputs": [],
   "source": [
    "# =========================================\n",
    "# Helper function\n",
    "# =========================================\n",
    "def prettychain(question: str):\n",
    "    response = rag_chain.invoke(question)\n",
    "    print(textwrap.fill(response, 80))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "9793d310-c27c-44c5-bf94-aebcfa64d267",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Netapp's primary business is focused on enterprise storage and data management,\n",
      "cloud storage, and cloud operations markets.\n"
     ]
    }
   ],
   "source": [
    "# =========================================\n",
    "# Queries\n",
    "# =========================================\n",
    "prettychain(\"What is Netapp's primary business?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "5a4113e8-ce30-4974-bbda-4af169ea5be4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Netapp is headquartered in San Jose, California.\n"
     ]
    }
   ],
   "source": [
    "prettychain(\"Where is Netapp headquartered?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "9ba590a7-f39f-4da9-b74f-f85e295e6351",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "NetApp, Inc. is a global cloud-led, data-centric software company that provides\n",
      "customers with the freedom to manage applications and data across hybrid\n",
      "multicloud environments.\n"
     ]
    }
   ],
   "source": [
    "prettychain(\"\"\"\n",
    "Tell me about Netapp. \n",
    "Limit your answer to a single sentence.\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "059f85fe-a8e7-4ec0-9809-db09b92d12b6",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The context provided does not mention Apple, so there is no information\n",
      "available to provide a sentence about Apple.\n"
     ]
    }
   ],
   "source": [
    "prettychain(\"\"\"\n",
    "Tell me about Apple. \n",
    "Limit your answer to a single sentence.\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "a3e19376-4fc5-42e9-870d-a12b6c8cefc2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "I don't know.\n"
     ]
    }
   ],
   "source": [
    "prettychain(\"\"\"\n",
    "Tell me about Apple. \n",
    "Limit your answer to a single sentence.\n",
    "If you are unsure about the answer, say you don't know.\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "f760d8f0-9c38-4b5d-8470-3600b1a0f5d1",
   "metadata": {},
   "outputs": [
    {
     "ename": "NameError",
     "evalue": "name 'prettychain' is not defined",
     "output_type": "error",
     "traceback": [
      "\u001b[31m---------------------------------------------------------------------------\u001b[39m",
      "\u001b[31mNameError\u001b[39m                                 Traceback (most recent call last)",
      "\u001b[36mCell\u001b[39m\u001b[36m \u001b[39m\u001b[32mIn[1]\u001b[39m\u001b[32m, line 1\u001b[39m\n\u001b[32m----> \u001b[39m\u001b[32m1\u001b[39m \u001b[43mprettychain\u001b[49m(\u001b[33m\"\u001b[39m\u001b[33mTell me about Netapp?\u001b[39m\u001b[33m\"\u001b[39m)\n",
      "\u001b[31mNameError\u001b[39m: name 'prettychain' is not defined"
     ]
    }
   ],
   "source": [
    "prettychain(\"Tell me about Netapp?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "bb46bbda-3791-497b-9ac0-a097c2bafa5d",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python (llm-env)",
   "language": "python",
   "name": "llm-env"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.15"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
