{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "0e1580a2-a8fd-4229-a216-73987886d647",
   "metadata": {},
   "outputs": [],
   "source": [
    "#Import packages and set up Neo4\n",
    "from dotenv import load_dotenv\n",
    "import os\n",
    "\n",
    "from langchain_community.graphs import Neo4jGraph\n",
    "\n",
    "# Warning control\n",
    "import warnings\n",
    "warnings.filterwarnings(\"ignore\")\n",
    "load_dotenv('.env', override=True)\n",
    "NEO4J_URI = os.getenv('NEO4J_URI')\n",
    "NEO4J_USERNAME = os.getenv('NEO4J_USERNAME')\n",
    "NEO4J_PASSWORD = os.getenv('NEO4J_PASSWORD')\n",
    "NEO4J_DATABASE = os.getenv('NEO4J_DATABASE')\n",
    "kg = Neo4jGraph(\n",
    "    url=NEO4J_URI, username=NEO4J_USERNAME, password=NEO4J_PASSWORD, database=NEO4J_DATABASE\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "5ced8bea-7574-4a12-b04d-fcc9c1eb50c6",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'count(n)': 171}]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Querying the movie knowledge graph\n",
    "cypher = \"\"\"\n",
    "  MATCH (n) \n",
    "  RETURN count(n)\n",
    "  \"\"\"\n",
    "result = kg.query(cypher)\n",
    "result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "75faae43-5cdc-4017-bb8a-c7aa35b204ed",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'numberOfNodes': 171}]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "  MATCH (n) \n",
    "  RETURN count(n) AS numberOfNodes\n",
    "  \"\"\"\n",
    "result = kg.query(cypher)\n",
    "result\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "41565bfb-0104-447d-93e1-108b19b87242",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "There are 171 nodes in this graph.\n"
     ]
    }
   ],
   "source": [
    "print(f\"There are {result[0]['numberOfNodes']} nodes in this graph.\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "8ad3aa54-3773-48f2-9903-0c0ebe6ff6ad",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'numberOfMovies': 38}]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Match only the Movie nodes by specifying the node label\n",
    "cypher = \"\"\"\n",
    "  MATCH (n:Movie) \n",
    "  RETURN count(n) AS numberOfMovies\n",
    "  \"\"\"\n",
    "kg.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "c44b1d2e-cb7f-40aa-85a4-ad35cf7b4f8a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'numberOfMovies': 38}]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Change the variable name in the node pattern match for improved readability\n",
    "cypher = \"\"\"\n",
    "  MATCH (m:Movie) \n",
    "  RETURN count(m) AS numberOfMovies\n",
    "  \"\"\"\n",
    "kg.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "56813788-254c-4d7c-8648-458a4421e546",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{'numberOfPeople': 133}]\n",
      "[{'tom': {'born': 1956, 'name': 'Tom Hanks'}}]\n",
      "[{'cloudAtlas': {'tagline': 'Everything is connected', 'title': 'Cloud Atlas', 'released': 2012}}]\n"
     ]
    }
   ],
   "source": [
    "#Match only the Person nodes\n",
    "cypher = \"\"\"\n",
    "  MATCH (people:Person) \n",
    "  RETURN count(people) AS numberOfPeople\n",
    "  \"\"\"\n",
    "result=kg.query(cypher)\n",
    "print(result)\n",
    "\n",
    "#Match a single person by specifying the value of the name property on the Person node\n",
    "cypher = \"\"\"\n",
    "  MATCH (tom:Person {name:\"Tom Hanks\"}) \n",
    "  RETURN tom\n",
    "  \"\"\"\n",
    "result=kg.query(cypher)\n",
    "print(result)\n",
    "\n",
    "#Match a single Movie by specifying the value of the title property\n",
    "cypher = \"\"\"\n",
    "  MATCH (cloudAtlas:Movie {title:\"Cloud Atlas\"}) \n",
    "  RETURN cloudAtlas\n",
    "  \"\"\"\n",
    "result = kg.query(cypher)\n",
    "print(result)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "be540e18-98fc-4d2b-b3d0-b4beef8cd42f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{'cloudAtlas.released': 2012}]\n",
      "[{'cloudAtlas.released': 2012, 'cloudAtlas.tagline': 'Everything is connected'}]\n"
     ]
    }
   ],
   "source": [
    "#Return only the released property of the matched Movie node\n",
    "cypher = \"\"\"\n",
    "  MATCH (cloudAtlas:Movie {title:\"Cloud Atlas\"}) \n",
    "  RETURN cloudAtlas.released\n",
    "  \"\"\"\n",
    "result = kg.query(cypher)\n",
    "print(result)\n",
    "\n",
    "#Return two properties\n",
    "cypher = \"\"\"\n",
    "  MATCH (cloudAtlas:Movie {title:\"Cloud Atlas\"}) \n",
    "  RETURN cloudAtlas.released, cloudAtlas.tagline\n",
    "  \"\"\"\n",
    "result = kg.query(cypher)\n",
    "print(result)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "7330445a-3bfb-4336-aaab-be76e116d300",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{'nineties.title': 'The Matrix'}, {'nineties.title': \"The Devil's Advocate\"}, {'nineties.title': 'A Few Good Men'}, {'nineties.title': 'As Good as It Gets'}, {'nineties.title': 'What Dreams May Come'}, {'nineties.title': 'Snow Falling on Cedars'}, {'nineties.title': \"You've Got Mail\"}, {'nineties.title': 'Sleepless in Seattle'}, {'nineties.title': 'Joe Versus the Volcano'}, {'nineties.title': 'When Harry Met Sally'}, {'nineties.title': 'That Thing You Do'}, {'nineties.title': 'The Birdcage'}, {'nineties.title': 'Unforgiven'}, {'nineties.title': 'Johnny Mnemonic'}, {'nineties.title': 'The Green Mile'}, {'nineties.title': 'Hoffa'}, {'nineties.title': 'Apollo 13'}, {'nineties.title': 'Twister'}, {'nineties.title': 'Bicentennial Man'}, {'nineties.title': 'A League of Their Own'}]\n"
     ]
    }
   ],
   "source": [
    "#Cypher patterns with conditional matching\n",
    "cypher = \"\"\"\n",
    "  MATCH (nineties:Movie) \n",
    "  WHERE nineties.released >= 1990 \n",
    "    AND nineties.released < 2000 \n",
    "  RETURN nineties.title\n",
    "  \"\"\"\n",
    "result = kg.query(cypher)\n",
    "print(result)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "64d19804-f74f-4d91-bea0-48a5325e280b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{'actor.name': 'Emil Eifrem', 'movie.title': 'The Matrix'}, {'actor.name': 'Hugo Weaving', 'movie.title': 'The Matrix'}, {'actor.name': 'Laurence Fishburne', 'movie.title': 'The Matrix'}, {'actor.name': 'Carrie-Anne Moss', 'movie.title': 'The Matrix'}, {'actor.name': 'Keanu Reeves', 'movie.title': 'The Matrix'}, {'actor.name': 'Hugo Weaving', 'movie.title': 'The Matrix Reloaded'}, {'actor.name': 'Laurence Fishburne', 'movie.title': 'The Matrix Reloaded'}, {'actor.name': 'Carrie-Anne Moss', 'movie.title': 'The Matrix Reloaded'}, {'actor.name': 'Keanu Reeves', 'movie.title': 'The Matrix Reloaded'}, {'actor.name': 'Hugo Weaving', 'movie.title': 'The Matrix Revolutions'}]\n",
      "[{'tom.name': 'Tom Hanks', 'tomHanksMovies.title': 'Apollo 13'}, {'tom.name': 'Tom Hanks', 'tomHanksMovies.title': \"You've Got Mail\"}, {'tom.name': 'Tom Hanks', 'tomHanksMovies.title': 'A League of Their Own'}, {'tom.name': 'Tom Hanks', 'tomHanksMovies.title': 'Joe Versus the Volcano'}, {'tom.name': 'Tom Hanks', 'tomHanksMovies.title': 'That Thing You Do'}, {'tom.name': 'Tom Hanks', 'tomHanksMovies.title': 'The Da Vinci Code'}, {'tom.name': 'Tom Hanks', 'tomHanksMovies.title': 'Cloud Atlas'}, {'tom.name': 'Tom Hanks', 'tomHanksMovies.title': 'Cast Away'}, {'tom.name': 'Tom Hanks', 'tomHanksMovies.title': 'The Green Mile'}, {'tom.name': 'Tom Hanks', 'tomHanksMovies.title': 'Sleepless in Seattle'}, {'tom.name': 'Tom Hanks', 'tomHanksMovies.title': 'The Polar Express'}, {'tom.name': 'Tom Hanks', 'tomHanksMovies.title': \"Charlie Wilson's War\"}]\n",
      "[{'coActors.name': 'Ed Harris', 'm.title': 'Apollo 13'}, {'coActors.name': 'Gary Sinise', 'm.title': 'Apollo 13'}, {'coActors.name': 'Kevin Bacon', 'm.title': 'Apollo 13'}, {'coActors.name': 'Bill Paxton', 'm.title': 'Apollo 13'}, {'coActors.name': 'Parker Posey', 'm.title': \"You've Got Mail\"}, {'coActors.name': 'Greg Kinnear', 'm.title': \"You've Got Mail\"}, {'coActors.name': 'Meg Ryan', 'm.title': \"You've Got Mail\"}, {'coActors.name': 'Steve Zahn', 'm.title': \"You've Got Mail\"}, {'coActors.name': 'Dave Chappelle', 'm.title': \"You've Got Mail\"}, {'coActors.name': 'Madonna', 'm.title': 'A League of Their Own'}, {'coActors.name': \"Rosie O'Donnell\", 'm.title': 'A League of Their Own'}, {'coActors.name': 'Geena Davis', 'm.title': 'A League of Their Own'}, {'coActors.name': 'Bill Paxton', 'm.title': 'A League of Their Own'}, {'coActors.name': 'Lori Petty', 'm.title': 'A League of Their Own'}, {'coActors.name': 'Nathan Lane', 'm.title': 'Joe Versus the Volcano'}, {'coActors.name': 'Meg Ryan', 'm.title': 'Joe Versus the Volcano'}, {'coActors.name': 'Liv Tyler', 'm.title': 'That Thing You Do'}, {'coActors.name': 'Charlize Theron', 'm.title': 'That Thing You Do'}, {'coActors.name': 'Ian McKellen', 'm.title': 'The Da Vinci Code'}, {'coActors.name': 'Audrey Tautou', 'm.title': 'The Da Vinci Code'}, {'coActors.name': 'Paul Bettany', 'm.title': 'The Da Vinci Code'}, {'coActors.name': 'Jim Broadbent', 'm.title': 'Cloud Atlas'}, {'coActors.name': 'Halle Berry', 'm.title': 'Cloud Atlas'}, {'coActors.name': 'Hugo Weaving', 'm.title': 'Cloud Atlas'}, {'coActors.name': 'Helen Hunt', 'm.title': 'Cast Away'}, {'coActors.name': 'Sam Rockwell', 'm.title': 'The Green Mile'}, {'coActors.name': 'Bonnie Hunt', 'm.title': 'The Green Mile'}, {'coActors.name': 'Patricia Clarkson', 'm.title': 'The Green Mile'}, {'coActors.name': 'James Cromwell', 'm.title': 'The Green Mile'}, {'coActors.name': 'Michael Clarke Duncan', 'm.title': 'The Green Mile'}, {'coActors.name': 'David Morse', 'm.title': 'The Green Mile'}, {'coActors.name': 'Gary Sinise', 'm.title': 'The Green Mile'}, {'coActors.name': 'Meg Ryan', 'm.title': 'Sleepless in Seattle'}, {'coActors.name': 'Victor Garber', 'm.title': 'Sleepless in Seattle'}, {'coActors.name': 'Bill Pullman', 'm.title': 'Sleepless in Seattle'}, {'coActors.name': 'Rita Wilson', 'm.title': 'Sleepless in Seattle'}, {'coActors.name': \"Rosie O'Donnell\", 'm.title': 'Sleepless in Seattle'}, {'coActors.name': 'Julia Roberts', 'm.title': \"Charlie Wilson's War\"}, {'coActors.name': 'Philip Seymour Hoffman', 'm.title': \"Charlie Wilson's War\"}]\n"
     ]
    }
   ],
   "source": [
    "#Pattern matching with multiple nodes\n",
    "cypher = \"\"\"\n",
    "  MATCH (actor:Person)-[:ACTED_IN]->(movie:Movie) \n",
    "  RETURN actor.name, movie.title LIMIT 10\n",
    "  \"\"\"\n",
    "result = kg.query(cypher)\n",
    "print(result)\n",
    "\n",
    "cypher = \"\"\"\n",
    "  MATCH (tom:Person {name: \"Tom Hanks\"})-[:ACTED_IN]->(tomHanksMovies:Movie) \n",
    "  RETURN tom.name,tomHanksMovies.title\n",
    "  \"\"\"\n",
    "result = kg.query(cypher)\n",
    "print(result)\n",
    "\n",
    "cypher = \"\"\"\n",
    "  MATCH (tom:Person {name:\"Tom Hanks\"})-[:ACTED_IN]->(m)<-[:ACTED_IN]-(coActors) \n",
    "  RETURN coActors.name, m.title\n",
    "  \"\"\"\n",
    "result = kg.query(cypher)\n",
    "print(result)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "596ba2d4-cb0e-4290-b2e1-b3d7ac39d33a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{'emil.name': 'Emil Eifrem', 'movie.title': 'The Matrix'}]\n",
      "[]\n"
     ]
    }
   ],
   "source": [
    "#Delete data from the graph\n",
    "cypher = \"\"\"\n",
    "MATCH (emil:Person {name:\"Emil Eifrem\"})-[actedIn:ACTED_IN]->(movie:Movie)\n",
    "RETURN emil.name, movie.title\n",
    "\"\"\"\n",
    "result = kg.query(cypher)\n",
    "print(result)\n",
    "\n",
    "cypher = \"\"\"\n",
    "MATCH (emil:Person {name:\"Emil Eifrem\"})-[actedIn:ACTED_IN]->(movie:Movie)\n",
    "DELETE actedIn\n",
    "\"\"\"\n",
    "result = kg.query(cypher)\n",
    "print(result)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "a2f3ecc6-97eb-41d3-a963-5c584b9c79e3",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python (llm-env)",
   "language": "python",
   "name": "llm-env"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.15"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
